{"halley":{"name":"Halley","bio":"<p><strong>Edmond Halley</strong> (1656. - 1742.) bio je engleski matematičar i fizičar, a drugi <em>astronom Royal</em>. Izračunao je orbitu Halleyevog kometa, koji je dobio ime po njemu.</p>"},"gauss":{"name":"Gauss","born":1777,"died":1855,"bio":"<p><strong>Carl Friedrich Gauss</strong> (1777. - 1855.) bio je vjerojatno najveći matematičar u povijesti. Napravio je revolucionarna otkrića u gotovo svim poljima matematike, od algebre i teorije brojeva do statistike, izračuna, geometrije, geologije i astronomije.</p><p>Prema legendi, ispravio je pogrešku u očevom računovodstvu u dobi od 3 godine i pronašao način da brzo sabere sve cjelobrojne brojeve od 1 do 100 u dobi od 8 godina. Prve važne spoznaje napravio je još kao tinejdžer , a kasnije je učio i mnoge druge poznate matematičare kao profesore.</p>","links":[{"title":"Prime Number Theorem","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Non-Euclidean Geometry","url":"/world/Dimensions_and_Distortions"},{"title":"Sums of Triangle Numbers","url":"/course/sequences/figurate#triangle-sums"}]},"fibonacci":{"name":"Fibonacci","born":1175,"died":1250,"bio":"<p><strong>Leonardo Pisano</strong>, poznatiji kao <strong>Fibonaccije</strong> (1175. - 1250.), bio je talijanski matematičar. Najpoznatiji je po nizu brojeva nazvanim po njemu: 1, 1, 2, 3, 5, 8, 13,…</p><p>Fibonaccije je također odgovorna za popularizaciju arapskih brojeva (0, 1, 2, 3, 4, ...) u Europi, koji su još u 12. stoljeću prije Krista koristili rimske brojeve (I, V, X, D, ...). Objasnio je decimalni sustav u knjizi zvanoj \"Liber Abaci\", praktičnom udžbeniku za trgovce.</p>","links":[{"title":"Fibonacci Numbers","url":"/course/sequences/fibonacci"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Euklid iz Aleksandrije</strong> (oko 300. godine prije Krista) bio je grčki matematičar i često ga nazivaju <em>ocem geometrije</em>. Objavio je knjigu <em>Elementi</em> koja je prvi uvela euklidsku geometriju i koja je sadržala mnogo važnih dokaza u teoriji geometrije i broja. Bio je to glavni udžbenik matematike sve do 19. stoljeća. U Aleksandriji je učio matematiku, ali o njegovom životu se zna vrlo malo.</p>","links":[{"title":"Euclid’s Axioms","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Infinitely many Primes","url":"/course/divisibility/primes#primes3"}]},"pythagoras":{"name":"Pythagoras","born":-570,"died":-495,"bio":"<p><strong>Pitagora iz Samosa</strong> (oko 570. - 495. godine prije Krista) bio je grčki filozof i matematičar. Najpoznatiji je po dokazivanju <em>Pitagorine teoreme</em>, ali napravio je mnoga druga matematička i znanstvena otkrića.</p><p>Pitagora je matematički pokušao objasniti glazbu i otkrio je da dva tona zvuče \"lijepo\" zajedno (suglasnički) ako je omjer njihovih frekvencija jednostavan ulomak.</p><p>Osnovao je i školu u Italiji u kojoj su on i njegovi učenici obožavali matematiku gotovo poput religije, slijedeći niz bizarnih pravila - ali školu su na kraju izgorjeli njihovi protivnici.</p>","links":[{"title":"Pythagoras’ Theorem","url":"/course/triangles/pythagoras"}]},"nicomachus":{"name":"Nicomachus","born":60,"died":120,"overflow":true,"bio":"<p><strong>Nicomachus iz Gerasa</strong> (oko 60 - 120) bio je drevni grčki matematičar koji je također mnogo vremena provodio razmišljajući o mističnim svojstvima brojeva. Njegova knjiga <em>Uvod u aritmetiku</em> sadrži prvo spominjanje savršenih brojeva.</p>","links":[{"title":"Perfect Numbers","url":"/course/sequences/special#perfect"}]},"collatz":{"name":"Collatz","bio":"<p><strong>Lothar Collatz</strong> (1910. - 1990.) bio je njemački matematičar koji je radio na diferencijalnim jednadžbama i problemima optimizacije. <em>Collatzova pretpostavka</em> ili <span class=\"math\" data-voice=\"3 x plus 1\"><mn>3</mn><mi>x</mi><mo value=\"+\">+</mo><mn>1</mn></span> problem je nazvan po njemu - i još uvijek nije riješen.</p>"},"conway":{"name":"Conway","born":1937,"died":2020,"bio":"<p><strong>John Horton Conway</strong> (1937. - 2020.) bio je britanski matematičar koji je radio na Sveučilištu Cambridge i Princeton. Bio je stipendist Kraljevskog društva i prvi dobitnik nagrade Pólya.</p><p>Istraživao je matematiku u podlozi svakodnevnih predmeta poput čvorova i igara, a pridonio je teoriji grupa, teoriji brojeva i mnogim drugim područjima matematike. Conway je poznat po tome što je izumio „Conwayevu igru života“, <em>ćelijskog automata</em> sa fascinantnim svojstvima.</p>","links":[{"title":"Look-and-say Sequence","url":"/course/sequences/special#look-and-say"}]},"pascal":{"name":"Pascal","born":1623,"died":1662,"bio":"<p><strong>Blaise Pascal</strong> (1623. - 1662.) bio je francuski matematičar, fizičar i filozof. Izumio je neke od prvih mehaničkih kalkulatora, kao i rad na projektivnoj geometriji, vjerojatnosti i fizici vakuuma.</p><p>Najpoznatije je da je Pascal zapamćen po tome što je nazvao <em>Pascalov trokut</em>, beskonačni trokut brojeva s nekim zadivljujućim svojstvima.</p>","links":[{"title":"Probability","url":"/course/probability/introduction"},{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"pingala":{"name":"Pingala","born":-330,"died":-270,"bio":"<p><strong>Pingala</strong> (poljski) bio je drevni indijski pjesnik i matematičar koji je živio oko 300. godine prije Krista, ali o njegovom životu se zna vrlo malo. Napisao je Chandaḥśāstra, gdje je matematički analizirao sanskrtsku poeziju. Sadržao je i prva poznata objašnjenja binarnih brojeva, Fibonaccijevih brojeva i Pascalovog trokuta.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"khayyam":{"name":"Khayyam","born":1048,"died":1131,"bio":"<p><strong>Omar Khayyam</strong> (عمر خیّام, 1048 - 1131) bio je perzijski matematičar, astronom i pjesnik. Uspio je klasificirati i riješiti sve kubne jednadžbe i pronašao je nove načine za razumijevanje Euklidove <em>paralelne aksiome</em>. Khayyam je također dizajnirao <em>Jalali kalendar</em>, precizan solarni kalendar koji se još uvijek koristi u nekim zemljama.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"singmaster":{"name":"Singmaster","bio":"<p><strong>David Singmaster</strong> (rođen 1939.) američki je matematičar koji je posebno poznat po svojim matematičkim zagonetkama i mozgalicama. Prvi je izmislio matematičke algoritme za analizu i rješavanje <em>Rubikove kocke</em>.</p>"}}