{"halley":{"name":"Halley","bio":"<p><strong>Edmond Halley</strong> (1656 - 1742) foi um matemático e físico inglês, e o segundo <em>Astrônomo Real</em>. Ele calculou a órbita do cometa Halley, que recebeu o nome dele.</p>"},"gauss":{"name":"Gauss","born":1777,"died":1855,"bio":"<p><strong>Carl Friedrich Gauss</strong> (1777 - 1855) foi sem dúvida o maior matemático da história. Ele fez descobertas inovadoras em praticamente todos os campos da matemática, da álgebra e teoria dos números à estatística, cálculo, geometria, geologia e astronomia.</p><p>Segundo a lenda, ele corrigiu um erro na contabilidade de seu pai aos 3 anos de idade e encontrou uma maneira de somar rapidamente todos os números inteiros de 1 a 100 aos 8 anos de idade. Ele fez suas primeiras descobertas importantes ainda adolescente e depois ensinou muitos outros matemáticos famosos como professor.</p>","links":[{"title":"Prime Number Theorem","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Non-Euclidean Geometry","url":"/world/Dimensions_and_Distortions"},{"title":"Sums of Triangle Numbers","url":"/course/sequences/figurate#triangle-sums"}]},"fibonacci":{"name":"Fibonacci","born":1175,"died":1250,"bio":"<p><strong>Leonardo Pisano</strong>, comumente conhecido como <strong>Fibonacci</strong> (1175 - 1250) era um matemático italiano. Ele é mais conhecido pela sequência numérica em seu nome: 1, 1, 2, 3, 5, 8, 13,…</p><p>Fibonacci também é responsável por popularizar os algarismos arábicos (0, 1, 2, 3, 4, ...) na Europa, que ainda usava algarismos romanos (I, V, X, D, ...) no século XII EC. Ele explicou o sistema decimal em um livro chamado \"Liber Abaci\", um livro prático para comerciantes.</p>","links":[{"title":"Fibonacci Numbers","url":"/course/sequences/fibonacci"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Euclides de Alexandria</strong> (por volta de 300 aC) era um matemático grego e é freqüentemente chamado de <em>pai da geometria</em>. Ele publicou um livro <em>Elements</em> que introduziu a geometria euclidiana e continha muitas provas importantes em geometria e teoria dos números. Foi o principal livro de matemática até o século XIX. Ele ensinou matemática em Alexandria, mas muito pouco se sabe sobre sua vida.</p>","links":[{"title":"Euclid’s Axioms","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Infinitely many Primes","url":"/course/divisibility/primes#primes3"}]},"pythagoras":{"name":"Pythagoras","born":-570,"died":-495,"bio":"<p>Pitágoras de Samos__ (c. 570 - 495 aC) era um filósofo e matemático grego. Ele é mais conhecido por provar o <em>teorema de Pitágoras</em>, mas fez muitas outras descobertas matemáticas e científicas.</p><p>Pitágoras tentou explicar a música de maneira matemática e descobriu que dois tons soam \"agradáveis\" juntos (consoante) se a proporção de suas frequências for uma fração simples.</p><p>Ele também fundou uma escola na Itália, onde ele e seus alunos adoravam matemática quase como uma religião, seguindo várias regras bizarras - mas a escola acabou sendo incendiada por seus adversários.</p>","links":[{"title":"Pythagoras’ Theorem","url":"/course/triangles/pythagoras"}]},"nicomachus":{"name":"Nicomachus","born":60,"died":120,"overflow":true,"bio":"<p><strong>Nicômaco de Gerasa</strong> (c. 60 - 120) era um matemático grego antigo que também passava muito tempo pensando nas propriedades místicas dos números. Seu livro <em>Introdução à Aritmética</em> contém a primeira menção de números perfeitos.</p>","links":[{"title":"Perfect Numbers","url":"/course/sequences/special#perfect"}]},"collatz":{"name":"Collatz","bio":"<p><strong>Lothar Collatz</strong> (1910 - 1990) era um matemático alemão trabalhando em equações diferenciais e problemas de otimização. O problema de <em>conjectura de Collatz</em> ou <span class=\"math\" data-voice=\"3 x plus 1\"><mn>3</mn><mi>x</mi><mo value=\"+\">+</mo><mn>1</mn></span> recebeu o nome dele - e ainda não foi resolvido.</p>"},"conway":{"name":"Conway","born":1937,"died":2020,"bio":"<p><strong>John Horton Conway</strong> (1937 - 2020) era um matemático britânico que trabalhou na Universidade de Cambridge e Princeton. Ele era membro da Royal Society e o primeiro ganhador do Prêmio Pólya.</p><p>Ele explorou a matemática subjacente de objetos do cotidiano, como nós e jogos, e contribuiu para a teoria de grupos, teoria dos números e muitas outras áreas da matemática. Conway é conhecido por inventar o \"Jogo da vida de Conway\", um <em>autômato celular</em> com propriedades fascinantes.</p>","links":[{"title":"Look-and-say Sequence","url":"/course/sequences/special#look-and-say"}]},"pascal":{"name":"Pascal","born":1623,"died":1662,"bio":"<p>Blaise Pascal__ (1623 - 1662) foi um matemático, físico e filósofo francês. Ele inventou algumas das primeiras calculadoras mecânicas, além de trabalhar na geometria projetiva, na probabilidade e na física do vácuo.</p><p>O mais famoso é que Pascal é lembrado por nomear <em>Triângulo de Pascal</em>, um triângulo infinito de números com algumas propriedades surpreendentes.</p>","links":[{"title":"Probability","url":"/course/probability/introduction"},{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"pingala":{"name":"Pingala","born":-330,"died":-270,"bio":"<p>Pingala__ (पिङ्गल) era um antigo poeta e matemático indiano que viveu por volta de 300 AEC, mas muito pouco se sabe sobre sua vida. Ele escreveu o Chandaḥśāstra, onde analisou matematicamente a poesia sânscrita. Também continha as primeiras explicações conhecidas sobre números binários, números de Fibonacci e o triângulo de Pascal.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"khayyam":{"name":"Khayyam","born":1048,"died":1131,"bio":"<p><strong>Omar Khayyam</strong> (عمر خیّام, 1048 - 1131) era um matemático, astrônomo e poeta persa. Ele conseguiu classificar e resolver todas as equações cúbicas e encontrou novas maneiras de entender o axioma paralelo de Euclides <em>_. Khayyam também projetou o _calendário Jalali</em>, um calendário solar preciso que ainda é usado em alguns países.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"singmaster":{"name":"Singmaster","bio":"<p><strong>David Singmaster</strong> (nascido em 1939) é um matemático americano que é particularmente conhecido por seus quebra-cabeças matemáticos e quebra-cabeças. Ele foi o primeiro a criar algoritmos matemáticos para analisar e resolver o <em>Cubo de Rubik</em>.</p>"}}