{"halley":{"name":"Halley","bio":"<p><strong>Edmond Halley</strong> (1656 - 1742) var en engelsk matematiker och fysiker och den andra <em>Astronomen Royal</em>. Han beräknade banan till Halley's Comet, som är uppkallad efter honom.</p>"},"gauss":{"name":"Gauss","born":1777,"died":1855,"bio":"<p><strong>Carl Friedrich Gauss</strong> (1777 - 1855) var utan tvekan den största matematikern i historien. Han gjorde banbrytande upptäckter inom nästan alla områden i matematik, från algebra och talteori till statistik, kalkyl, geometri, geologi och astronomi.</p><p>Enligt legenden korrigerade han ett misstag i sin fars bokföring vid 3 års ålder och fann ett sätt att snabbt lägga till alla heltal från 1 till 100 vid 8 års ålder. Han gjorde sina första viktiga upptäckter medan han fortfarande var tonåring och lärde senare många andra kända matematiker som professor.</p>","links":[{"title":"Prime Number Theorem","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Non-Euclidean Geometry","url":"/world/Dimensions_and_Distortions"},{"title":"Sums of Triangle Numbers","url":"/course/sequences/figurate#triangle-sums"}]},"fibonacci":{"name":"Fibonacci","born":1175,"died":1250,"bio":"<p><strong>Leonardo Pisano</strong>, allmänt känd som <strong>Fibonacci</strong> (1175 - 1250) var en italiensk matematiker. Han är bäst känd för nummersekvensen uppkallad efter honom: 1, 1, 2, 3, 5, 8, 13, ...</p><p>Fibonacci ansvarar också för att popularisera de arabiska siffrorna (0, 1, 2, 3, 4, ...) i Europa, som fortfarande använde romerska siffror (I, V, X, D, ...) under 1100-talet. Han förklarade decimalsystemet i en bok som heter \"Liber Abaci\", en praktisk lärobok för köpmän.</p>","links":[{"title":"Fibonacci Numbers","url":"/course/sequences/fibonacci"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Euklid av Alexandria</strong> (cirka 300 fvt) var en grekisk matematiker och kallas ofta <em>geometriens fader</em>. Han publicerade en bok <em>Elements</em> som först introducerade euklidisk geometri och innehöll många viktiga bevis inom geometri och talteori. Det var den huvudsakliga matematikboken fram till 1800-talet. Han undervisade i matematik i Alexandria, men mycket lite annat är känt om hans liv.</p>","links":[{"title":"Euclid’s Axioms","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Infinitely many Primes","url":"/course/divisibility/primes#primes3"}]},"pythagoras":{"name":"Pythagoras","born":-570,"died":-495,"bio":"<p><strong>Pythagoras of Samos</strong> (c. 570 - 495 fvt) var en grekisk filosof och matematiker. Han är mest känd för att bevisa <em>Pythagoras 'teorem</em>, men gjorde många andra matematiska och vetenskapliga upptäckter.</p><p>Pythagoras försökte förklara musik på ett matematiskt sätt och upptäckte att två toner låter \"trevligt\" tillsammans (konsonant) om förhållandet mellan deras frekvenser är en enkel bråk.</p><p>Han grundade också en skola i Italien där han och hans elever dyrkade matematik nästan som en religion, medan han följde ett antal bisarra regler - men skolan brändes så småningom av deras motståndare.</p>","links":[{"title":"Pythagoras’ Theorem","url":"/course/triangles/pythagoras"}]},"nicomachus":{"name":"Nicomachus","born":60,"died":120,"overflow":true,"bio":"<p><strong>Nicomachus från Gerasa</strong> (ca 60 - 120) var en forntida grekisk matematiker som också spenderade mycket tid på att tänka på de mystiska egenskaperna hos siffror. Hans bok <em>Introduktion till aritmetik</em> innehåller första omnämnandet av perfekta siffror.</p>","links":[{"title":"Perfect Numbers","url":"/course/sequences/special#perfect"}]},"collatz":{"name":"Collatz","bio":"<p><strong>Lothar Collatz</strong> (1910 - 1990) var en tysk matematiker som arbetade med differentiella ekvationer och optimeringsproblem. Problemet <em>Collatz conjecture</em> eller <span class=\"math\" data-voice=\"3 x plus 1\"><mn>3</mn><mi>x</mi><mo value=\"+\">+</mo><mn>1</mn></span> heter efter honom</p><ul> <li>och är fortfarande olöst.</li></ul> "},"conway":{"name":"Conway","born":1937,"died":2020,"bio":"<p><strong>John Horton Conway</strong> (1937 - 2020) var en brittisk matematiker som arbetade vid Cambridge och Princeton University. Han var en kollega i Royal Society och den första mottagaren av Pólya-priset.</p><p>Han utforskade den underliggande matematiken för vardagsobjekt som knutar och spel, och han bidrog till gruppteori, talteori och många andra områden inom matematik. Conway är känd för att ha uppfunnit \"Conway's Game of Life\", en <em>mobilautomat</em> med fascinerande egenskaper.</p>","links":[{"title":"Look-and-say Sequence","url":"/course/sequences/special#look-and-say"}]},"pascal":{"name":"Pascal","born":1623,"died":1662,"bio":"<p><strong>Blaise Pascal</strong> (1623 - 1662) var en fransk matematiker, fysiker och filosof. Han uppfann några av de första mekaniska räknarna, liksom arbetade med projektiv geometri, sannolikhet och vakuumets fysik.</p><p>Mest känt är att Pascal kommer ihåg för att ha namngivit <em>Pascal's Triangle</em>, en oändlig triangel med siffror med några fantastiska egenskaper.</p>","links":[{"title":"Probability","url":"/course/probability/introduction"},{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"pingala":{"name":"Pingala","born":-330,"died":-270,"bio":"<p><strong>Pingala</strong> (पिङ्गल) var en forntida indisk poet och matematiker som levde omkring 300 f.Kr., men mycket lite är känt om hans liv. Han skrev Chandaḥśāstra, där han analyserade sanskrit poesi matematiskt. Den innehöll också de första kända förklaringarna om binära siffror, Fibonacci-nummer och Pascal triangel.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"khayyam":{"name":"Khayyam","born":1048,"died":1131,"bio":"<p><strong>Omar Khayyam</strong> (عمر خیّام, 1048 - 1131) var en persisk matematiker, astronom och poet. Han lyckades klassificera och lösa alla kubiska ekvationer och fann nya sätt att förstå Euclids <em>parallella axiom</em>. Khayyam designade också <em>Jalali-kalendern</em>, en exakt solkalender som fortfarande används i vissa länder.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"singmaster":{"name":"Singmaster","bio":"<p><strong>David Singmaster</strong> (född 1939) är en amerikansk matematiker som är särskilt känd för sina matematiska pussel och hjärnteatrar. Han var den första som kom med matematiska algoritmer för att analysera och lösa <em>Rubik's Cube</em>.</p>"}}