{"halley":{"name":"Halley","bio":"<p><strong>Edmond Halley</strong> (1656-1742) fue un matemático y físico inglés, y el segundo <em>Astrónomo Real</em>. Calculó la órbita del cometa Halley, que lleva su nombre.</p>"},"gauss":{"name":"Gauss","born":1777,"died":1855,"bio":"<p><strong>Carl Friedrich Gauss</strong> (1777-1855) fue posiblemente el mejor matemático de la historia. Hizo descubrimientos innovadores en casi todos los campos de las matemáticas, desde álgebra y teoría de números hasta estadística, cálculo, geometría, geología y astronomía.</p><p>Según la leyenda, corrigió un error en la contabilidad de su padre a la edad de 3 años, y encontró la manera de sumar rápidamente todos los enteros del 1 al 100 a la edad de 8. Hizo sus primeros descubrimientos importantes cuando aún era un adolescente. , y luego enseñó a muchos otros matemáticos famosos como profesor.</p>","links":[{"title":"Prime Number Theorem","url":"/course/divisibility/the-distribution-of-primes#riemann"},{"title":"Non-Euclidean Geometry","url":"/world/Dimensions_and_Distortions"},{"title":"Sums of Triangle Numbers","url":"/course/sequences/figurate#triangle-sums"}]},"fibonacci":{"name":"Fibonacci","born":1175,"died":1250,"bio":"<p><strong>Leonardo Pisano</strong>, comúnmente conocido como <strong>Fibonacci</strong> (1175-1250) fue un matemático italiano. Es mejor conocido por la secuencia numérica que lleva su nombre: 1, 1, 2, 3, 5, 8, 13, ...</p><p>Fibonacci también es responsable de popularizar los números arábigos (0, 1, 2, 3, 4, ...) en Europa, que todavía usaba números romanos (I, V, X, D, ...) en el siglo XII CE. Explicó el sistema decimal en un libro llamado \"Liber Abaci\", un libro de texto práctico para comerciantes.</p>","links":[{"title":"Fibonacci Numbers","url":"/course/sequences/fibonacci"}]},"euclid":{"name":"Euclid","born":-330,"died":-270,"bio":"<p><strong>Euclides de Alejandría</strong> (alrededor del 300 a. C.) era un matemático griego y a menudo se le llama el <em>padre de la geometría</em>. Publicó un libro <em>Elementos</em> que introdujo por primera vez la geometría euclidiana y contenía muchas pruebas importantes en geometría y teoría de números. Fue el principal libro de texto de matemáticas hasta el siglo XIX. Enseñó matemáticas en Alejandría, pero se sabe muy poco sobre su vida.</p>","links":[{"title":"Euclid’s Axioms","url":"/course/euclidean-geometry/euclids-axioms"},{"title":"Infinitely many Primes","url":"/course/divisibility/primes#primes3"}]},"pythagoras":{"name":"Pythagoras","born":-570,"died":-495,"bio":"<p><strong>Pitágoras de Samos</strong> (c. 570 - 495 a. C.) fue un filósofo y matemático griego. Es mejor conocido por probar el teorema de <em>Pitágoras</em>, pero realizó muchos otros descubrimientos matemáticos y científicos.</p><p>Pitágoras trató de explicar la música de manera matemática, y descubrió que dos tonos suenan \"bien\" juntos (consonantes) si la proporción de sus frecuencias es una fracción simple.</p><p>También fundó una escuela en Italia donde él y sus alumnos adoraban las matemáticas casi como una religión, mientras seguían una serie de reglas extrañas, pero la escuela finalmente fue incendiada por sus adversarios.</p>","links":[{"title":"Pythagoras’ Theorem","url":"/course/triangles/pythagoras"}]},"nicomachus":{"name":"Nicomachus","born":60,"died":120,"overflow":true,"bio":"<p><strong>Nicomachus of Gerasa</strong> (c. 60 - 120) fue un antiguo matemático griego que también pasó mucho tiempo pensando en las propiedades místicas de los números. Su libro <em>Introducción a la aritmética</em> contiene la primera mención de números perfectos.</p>","links":[{"title":"Perfect Numbers","url":"/course/sequences/special#perfect"}]},"collatz":{"name":"Collatz","bio":"<p><strong>Lothar Collatz</strong> (1910 - 1990) fue un matemático alemán que trabajó en ecuaciones diferenciales y problemas de optimización. El problema de <em>conjetura de Collatz</em> o <span class=\"math\" data-voice=\"3 x plus 1\"><mn>3</mn><mi>x</mi><mo value=\"+\">+</mo><mn>1</mn></span> lleva su nombre, y aún no se ha resuelto.</p>"},"conway":{"name":"Conway","born":1937,"died":2020,"bio":"<p><strong>John Horton Conway</strong> (1937 - 2020) fue un matemático británico que trabajó en Cambridge y la Universidad de Princeton. Fue miembro de la Royal Society, y el primer recipiente del Premio Pólya.</p><p>Exploró las matemáticas subyacentes de los objetos cotidianos, como los nudos y los juegos, y contribuyó a la teoría de grupos, la teoría de números y muchas otras áreas de las matemáticas. Conway es conocido por inventar el \"Juego de la vida de Conway\", un <em>autómata celular</em> con propiedades fascinantes.</p>","links":[{"title":"Look-and-say Sequence","url":"/course/sequences/special#look-and-say"}]},"pascal":{"name":"Pascal","born":1623,"died":1662,"bio":"<p><strong>Blaise Pascal</strong> (1623 - 1662) fue un matemático, físico y filósofo francés. Inventó algunas de las primeras calculadoras mecánicas, además de trabajar en geometría proyectiva, probabilidad y física del vacío.</p><p>Lo más famoso es que Pascal es recordado por nombrar <em>Triángulo de Pascal</em>, un triángulo infinito de números con algunas propiedades sorprendentes.</p>","links":[{"title":"Probability","url":"/course/probability/introduction"},{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"pingala":{"name":"Pingala","born":-330,"died":-270,"bio":"<p><strong>Pingala</strong> (पिङ्गल) fue un antiguo poeta y matemático indio que vivió alrededor del año 300 a. C., pero se sabe muy poco sobre su vida. Escribió la Chandaḥśāstra, donde analizó matemáticamente la poesía sánscrita. También contenía las primeras explicaciones conocidas de números binarios, números de Fibonacci y el triángulo de Pascal.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"khayyam":{"name":"Khayyam","born":1048,"died":1131,"bio":"<p><strong>Omar Khayyam</strong> (عمر خیّام, 1048-1131) fue un matemático, astrónomo y poeta persa. Se las arregló para clasificar y resolver todas las ecuaciones cúbicas, y encontró nuevas formas de entender el <em>axioma paralelo</em> de Euclides. Khayyam también diseñó el <em>calendario Jalali</em>, un calendario solar preciso que todavía se usa en algunos países.</p>","links":[{"title":"Pascal’s Triangle","url":"/course/sequences/pascals-triangle"}]},"singmaster":{"name":"Singmaster","bio":"<p><strong>David Singmaster</strong> (nacido en 1939) es un matemático estadounidense particularmente conocido por sus acertijos matemáticos y acertijos. Fue el primero en crear algoritmos matemáticos para analizar y resolver el <em>Cubo de Rubik</em>.</p>"}}